use ksoa;


--select * from zhiydoc where dzyname in ('刘国强1','刘国强(担)')

--update zhiydoc set lgnname = '' , is_czy = '' where dzyname in ('刘国强1','刘国强(担)')




--select rszht,* from zhiydoc where dzyname in ('黄国军','裴华','张宝文','龚毅兵','廖海昌','李艳锋','黄国红','邹建军','周强','杨艳平','袁仲贤','李小林','廖水英','刘雪松','黄绍华','陈叶红','张艳英','付细龙','傅影珍','周文隆','何惠桃','杨艳','杨勇','熊芳','曾龙春','杨明林','彭斌','杨军','肖志','敖小燕','崔志富','傅菊珍','段广多','彭群华','黄新华','李萍','任锐','鲁竹林','赵敏','杨燕红','郭健','付樟飞','桂俊春','郭玲娜','张志峰','陶闯明','冯育民','皮雪猛','陈虹','洪慧玲','付贵兰','廖桂芳','谢东其','黄辉亮','卢树生','付燕辉','黎文红','周绍武','李伟林','黄小琴','朱发辉','周淑云','傅建杨','李丽华','舒碧棉','游焕彪','杨大洋','杨卫华','周红','杨月根','黄军华','刘燕子','陈春晓','李平旦','周玲玲','殷多俊','刘锦锋','章立波','敖伟方','谢艳','游丽娟','刘香梅','黄亮军','张志荣','张梦阳','朱辉','王海峰','梁宗铭','廖玉华','过建军','高立伟','谢杨','谢蒙','王娥','朱敏','梁永亮','陈国平','卢海红','李贱如','鄢慧英','王吉','肖少平','杨俊元','范爱群','周江隆','胡文倩','杨爱平','刘志忠','郭国林','刘晓思','杨津','付春华','刘贤星','杨金梅','李志宏','张妹琴','邹晓军','付有林','刘茜','谢文娟','刘腊孙','王初洪','刘冬华','蔡丽萍','徐建刚','杨红保','聂凤琴','饶风辉','罗青','徐桂民','王志荣','苏亚洲','肖飞云','谢红霞','胡波','李建华','冷望成','程俊','肖艳辉','徐守春','高菲菲','刘朝阳','何权林','皮凤兰','黄玲','魏斯文','杨凯','邹力','万志超','胡志峰','邓志武','童有英','张志红','采购中心','许国柱','张春洲','邹志伟','黄宇','肖国兰','刘广','胡珍桂','夏斌','刘言如','刘芳冰','雷芳','阴慧滢','陈江波','桂文梁','张根兴','李振','罗伟','聂美春','谢建民','卢望','罗小丽','陈国华','刘香香','张小燕','杜新根','郭新力','付宝兰','金文','章敏军','敖秀娟','付文兵','李明会','黄小亮','杜干卫','刘赏月','聂绍敏','张远文','曹刚','万娟','熊军华') and rszht = '离职'

select * from zhiydoc where dzyname = '黄亚京'

update zhiydoc set rszht = '离职' where dzyname = '黄亚京'

update zhiydoc set is_ywy = '是' where dzyname = '黄亚京'


